"""
2. Что такое Джанго? И почему он используется?
4. В чёт суть паттерна и основной идеи DRY? Don’t repeat yourself.
6. Что такое шаблоны в Django? Покажите пример шаблона и расскажите об их структуре.
8. Каким образом к Django-backend можно подключить frontend react или vue? Что за библиотека и её предназначение?
10. Что такое маршруты? Каким образом можно их строить в Django? Регулярные выражения?
12. Какова функция параметра on_delete в поле ForeignKey?
14. Что такое CRUD?

16. Что такое django сигналы? Для чего их можно использовать?

18. Что такое авторизация и аутентификация? Какие способы их использования есть в Django?

20. Расскажите об утилите django-admin.

22. Перечислите какие базы данных поддерживает Django? Как выполнить переключение между базой PostgreSQL и SQLite?

24. Что за функция render (внутри django.shortcuts)? Что такое контекст? И что он передаёт и куда?

26. В чём суть промежуточного(middleware) ПО в Django? Какие есть стандартные middleware и для чего они?

28. Какие стили наследования есть в Python и какие из них использует Django.

30. Что такое миксин? Напишите новый контроллер-класс и добавьте к нему одну из примесей.

32. Как выполнить чистый SQL код внутри Python и Django?

34. Что такое функция «django.shortcuts.render»?

36. Что такое объект Q? Для чего он применяется и пару вариантов его использования.
-- Это сложные запросы к БД, например с условием или. filter(Q(title__contains='django') | Q(text__contains='django'))
"""

"""
1. Как выглядит структура django MVT паттерна (можно упрощённо)? Можно словами, можно нарисовать схему. 
3. Как выглядит структура проекта и приложения в Django? Если конкретнее, то что за файлы внутри каждого из них и для чего? 
5. Что такое модели в Django? Покажите пример модели и расскажите об их структуре. 
7. Что такое контроллеры или вью в Django? Покажите пример функции-контроллера и класса-контроллера и расскажите об их структуре. 
9. Что такое статические файлы и какие настройки определяют место их сбора и хранения? 
11. В чём разница между CharField и Textfield. 
13. Что такое csrf? Как его подключить к форме? 
15. Можно ли использовать команду runserver для запуска «боевого проекта» и почему нет? 
17. Что такое кеширование? Какие способы кеширования есть в Django? 
19. Django это CMS? Если нет, в чём отличия. 
21. Что такое шаблоны Jinja? 
23. Как фильтровать элементы в модели? 
25. ** Как использовать django ORM для создания данных партиями / пачкой? 
27. Что такое django ORM? Как получить все записи с модели? Как их отфильтровать или искать внутри? Перечислите все методы ORM. 
29. Разница между связью ForeignKey и OneToOne? Расскажите о примере использования обеих. 
31. Объясните авторизацию пользователя в Django? 
33. ** В чём разница между select_related и prefetc_related? Покажите синонемичный код на SQL. 
35. Расскажите о безопасности Django. 
37. ** Какой цикл ответа и запроса в Django?
"""
